foucault-dynamics/IoT-Firmware/firmware/meter_node/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# The SuperMini exposes only the built-in USB Serial/JTAG port, which is what
# the Arduino build reached via ARDUINO_USB_CDC_ON_BOOT.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# DIO flash mode, matching board_build.flash_mode in the PlatformIO build.
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# 1 ms scheduler tick: the LoRa and ESP-NOW paths wait on millisecond timeouts.
CONFIG_FREERTOS_HZ=1000

# Match the partition table PlatformIO is pinned to in platformio.ini, so both
# toolchains flash an identical 1500K app partition.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
